P01_HTTPBinAPI_PT_StreeTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers"/>
      </HeaderManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="BodyData -- Delete/Post/Patch/Put" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PostName" elementType="Argument">
            <stringProp name="Argument.name">PostName</stringProp>
            <stringProp name="Argument.value">${__RandomString(8,abcdefghijklmno,)},</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PostNum" elementType="Argument">
            <stringProp name="Argument.name">PostNum</stringProp>
            <stringProp name="Argument.value">${__Random(10,99,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
        <stringProp name="scriptLanguage">groovy</stringProp>
        <stringProp name="cacheKey">true</stringProp>
        <stringProp name="script">sampler.setProtocol(&quot;http&quot;)
sampler.setDomain(&quot;localhost&quot;)
sampler.setPort(80)
</stringProp>
      </JSR223PreProcessor>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="JK03_StressTest_HTTPMethods">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1129335053">
            <stringProp name="52469">500</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="JK03_DELETERequest_gunicorn" enabled="true">
          <stringProp name="HTTPSampler.path">/delete</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;${PostName}&quot;,&#xd;
    &quot;age&quot;: ${PostNum}&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Respnse Time Verfication" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get response time in milliseconds
long respTime = prev.getTime()

// Fail if response time &lt;= 1000 ms (1 second)
if (respTime &gt; 1000) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Response time &gt; 1 second: &quot; + respTime + &quot; ms&quot;)
}</stringProp>
            <stringProp name="TestPlan.comments">Verfiication Of the Request Response Time &gt; 1sec</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Code Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.getResponseCode() == &quot;200&quot;) {
   log.info(&quot;Request successful! with Code : ${prev.getResponseCode()}&quot;)
} else {
   log.error(&quot;Request failed with response code: ${prev.getResponseCode()}&quot;)
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Data Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseData = prev.getResponseDataAsString()

def expectedValue = &quot;Apache-HttpClient&quot;

if (responseData.contains(expectedValue)) {
	log.info(&quot;Assertion Passed: Response contains the ${expectedValue}.&quot;)
} else {
	log.error(&quot;Assertion Failed: Response does not contains the ${expectedValue}.&quot;)
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify Error Rate &lt; 1% " enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

def failed = prev.getErrorCount()
def total = prev.getSampleCount()

if (total &gt; 0) {
    def errorRate = (failed / total) * 100
    if (errorRate &gt; 1) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&quot;Error rate above 1%: &quot; + errorRate + &quot;%&quot;)
    }
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="JK03_GETRequest_gunicorn" enabled="true">
          <stringProp name="HTTPSampler.path">/get</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Respnse Time Verfication" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get response time in milliseconds
long respTime = prev.getTime()

// Fail if response time &lt;= 1000 ms (1 second)
if (respTime &gt; 1000) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Response time &gt; 1 second: &quot; + respTime + &quot; ms&quot;)
}</stringProp>
            <stringProp name="TestPlan.comments">Verfiication Of the Request Response Time &gt; 1sec</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Code Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.getResponseCode() == &quot;200&quot;) {
   log.info(&quot;Request successful! with Code : ${prev.getResponseCode()}&quot;)
} else {
   log.error(&quot;Request failed with response code: ${prev.getResponseCode()}&quot;)
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Data Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseData = prev.getResponseDataAsString()

def expectedValue = &quot;Apache-HttpClient&quot;

if (responseData.contains(expectedValue)) {
	log.info(&quot;Assertion Passed: Response contains the ${expectedValue}.&quot;)
} else {
	log.error(&quot;Assertion Failed: Response does not contains the ${expectedValue}.&quot;)
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify Error Rate &lt; 1% " enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

def failed = prev.getErrorCount()
def total = prev.getSampleCount()

if (total &gt; 0) {
    def errorRate = (failed / total) * 100
    if (errorRate &gt; 1) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&quot;Error rate above 1%: &quot; + errorRate + &quot;%&quot;)
    }
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="JK03_PATCHRequest_gunicorn" enabled="true">
          <stringProp name="HTTPSampler.path">/patch</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PATCH</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;${PostName}&quot;,&#xd;
    &quot;age&quot;: ${PostNum}&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Respnse Time Verfication" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get response time in milliseconds
long respTime = prev.getTime()

// Fail if response time &lt;= 1000 ms (1 second)
if (respTime &gt; 1000) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Response time &gt; 1 second: &quot; + respTime + &quot; ms&quot;)
}</stringProp>
            <stringProp name="TestPlan.comments">Verfiication Of the Request Response Time &gt; 1sec</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Code Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.getResponseCode() == &quot;200&quot;) {
   log.info(&quot;Request successful! with Code : ${prev.getResponseCode()}&quot;)
} else {
   log.error(&quot;Request failed with response code: ${prev.getResponseCode()}&quot;)
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Data Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseData = prev.getResponseDataAsString()

def expectedValue = &quot;Apache-HttpClient&quot;

if (responseData.contains(expectedValue)) {
	log.info(&quot;Assertion Passed: Response contains the ${expectedValue}.&quot;)
} else {
	log.error(&quot;Assertion Failed: Response does not contains the ${expectedValue}.&quot;)
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify Error Rate &lt; 1% " enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

def failed = prev.getErrorCount()
def total = prev.getSampleCount()

if (total &gt; 0) {
    def errorRate = (failed / total) * 100
    if (errorRate &gt; 1) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&quot;Error rate above 1%: &quot; + errorRate + &quot;%&quot;)
    }
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="JK03_POSTRequest_gunicorn" enabled="true">
          <stringProp name="HTTPSampler.path">/post</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;${PostName}&quot;,&#xd;
    &quot;age&quot;: ${PostNum}&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Respnse Time Verfication" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get response time in milliseconds
long respTime = prev.getTime()

// Fail if response time &lt;= 1000 ms (1 second)
if (respTime &gt; 1000) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Response time &gt; 1 second: &quot; + respTime + &quot; ms&quot;)
}</stringProp>
            <stringProp name="TestPlan.comments">Verfiication Of the Request Response Time &gt; 1sec</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Code Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.getResponseCode() == &quot;200&quot;) {
   log.info(&quot;Request successful! with Code : ${prev.getResponseCode()}&quot;)
} else {
   log.error(&quot;Request failed with response code: ${prev.getResponseCode()}&quot;)
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Data Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseData = prev.getResponseDataAsString()

def expectedValue = &quot;Apache-HttpClient&quot;

if (responseData.contains(expectedValue)) {
	log.info(&quot;Assertion Passed: Response contains the ${expectedValue}.&quot;)
} else {
	log.error(&quot;Assertion Failed: Response does not contains the ${expectedValue}.&quot;)
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify Error Rate &lt; 1% " enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

def failed = prev.getErrorCount()
def total = prev.getSampleCount()

if (total &gt; 0) {
    def errorRate = (failed / total) * 100
    if (errorRate &gt; 1) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&quot;Error rate above 1%: &quot; + errorRate + &quot;%&quot;)
    }
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="JK03_POSTRequest_gunicorn" enabled="true">
          <stringProp name="HTTPSampler.path">/put</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;${PostName}&quot;,&#xd;
    &quot;age&quot;: ${PostNum}&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Respnse Time Verfication" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get response time in milliseconds
long respTime = prev.getTime()

// Fail if response time &lt;= 1000 ms (1 second)
if (respTime &gt; 1000) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Response time &gt; 1 second: &quot; + respTime + &quot; ms&quot;)
}</stringProp>
            <stringProp name="TestPlan.comments">Verfiication Of the Request Response Time &gt; 1sec</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Code Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (prev.getResponseCode() == &quot;200&quot;) {
   log.info(&quot;Request successful! with Code : ${prev.getResponseCode()}&quot;)
} else {
   log.error(&quot;Request failed with response code: ${prev.getResponseCode()}&quot;)
}</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Response Data Verification" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseData = prev.getResponseDataAsString()

def expectedValue = &quot;Apache-HttpClient&quot;

if (responseData.contains(expectedValue)) {
	log.info(&quot;Assertion Passed: Response contains the ${expectedValue}.&quot;)
} else {
	log.error(&quot;Assertion Failed: Response does not contains the ${expectedValue}.&quot;)
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify Error Rate &lt; 1% " enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

def failed = prev.getErrorCount()
def total = prev.getSampleCount()

if (total &gt; 0) {
    def errorRate = (failed / total) * 100
    if (errorRate &gt; 1) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&quot;Error rate above 1%: &quot; + errorRate + &quot;%&quot;)
    }
}
</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/opt/jmeter-results/Stress/Stress-test-500-users-aggregatereport.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/opt/jmeter-results/Stress/Stress-test-500-users-summaryreport.xml</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
          <stringProp name="filename">/opt/jmeter-results/Stress/Stress-test-500-users-viewtable.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/opt/jmeter-results/Stress/Stress-test-500-users-simpledata.txt</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="Assertion Results" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>